In [1]:
import mysql.connector
mydb = mysql.connector.connect(
  host="localhost",
  user="root",
  password="pass"
)

In [2]:
mycursor = mydb.cursor()
sql = "CREATE DATABASE Shop2"
mycursor.execute(sql)

In [3]:
mydb = mysql.connector.connect(
    host = "localhost",
    user = "root",
    password = "pass",
    database= "Shop2"
)
mycursor = mydb.cursor()

In [4]:
sql = """
        CREATE TABLE Products(
        p_id int NOT NULL,
        product_name varchar(255),
        PRIMARY KEY (p_id)
        );
"""
mycursor.execute(sql)

In [5]:
sql = """
        CREATE TABLE Customers(
        c_id int NOT NULL,
        customer_name varchar(255) NOT NULL,
        PRIMARY KEY (c_id)
        );
"""
mycursor.execute(sql)

In [6]:
sql = "SHOW TABLES"
mycursor.execute(sql)
for i in mycursor:
    print(i)

('Customers',)
('Products',)

In [7]:
mycursor.execute("DESCRIBE Customers")
res = mycursor.fetchall()
res

[('c_id', b'int', 'NO', 'PRI', None, ''),
 ('customer_name', b'varchar(255)', 'NO', '', None, '')]

In [8]:
mycursor.execute("DESCRIBE Products")
res = mycursor.fetchall()
res

[('p_id', b'int', 'NO', 'PRI', None, ''),
 ('product_name', b'varchar(255)', 'YES', '', None, '')]

In [9]:
sql = """
        CREATE TABLE Customers_Products(
        c_id int NOT NULL,
        p_id int NOT NULL,
        FOREIGN KEY (c_id) REFERENCES Customers(c_id),
        FOREIGN KEY (p_id) REFERENCES Products(p_id)
        );
"""
mycursor.execute(sql)

In [10]:
mycursor.execute("DESCRIBE Customers_Products")
res = mycursor.fetchall()
res

[('c_id', b'int', 'NO', 'MUL', None, ''),
 ('p_id', b'int', 'NO', 'MUL', None, '')]

In [12]:
sql = """INSERT INTO Customers VALUES (1, 'Ali'),
                                 (2, 'Sara'),
                                 (3, 'Diana'),
                                 (4, 'Maryam'),
                                 (5, ,Zahra')                  
      """
mycursor.execute(sql)

In [13]:
sql = """INSERT INTO Products VALUES (1, 'laptop1'),
                                 (2, 'laptop2'),
                                 (3, 'laptop3'),
                                 (4, 'laptop4'),
                                 (5, 'laptop5')                  
      """
mycursor.execute(sql)

In [15]:
sql = "SELECT * FROM Customers"
mycursor.execute(sql)
data = mycursor.fetchall()
data

[(1, 'Ali'), (2, 'Sara'), (3, 'Diana'), (4, 'Maryam'), (5, 'Zahra')]

In [16]:
sql = "SELECT * FROM Products"
mycursor.execute(sql)
data = mycursor.fetchall()
data

[(1, 'laptop1'),
 (2, 'laptop2'),
 (3, 'laptop3'),
 (4, 'laptop4'),
 (5, 'laptop5')]

In [17]:
sql = """INSERT INTO Customers_Products VALUES 
                                            (1, 1),
                                            (1, 4),
                                            (3, 4),
                                            (5, 3)                 
      """
mycursor.execute(sql)

In [41]:
sql = """
        SELECT * FROM Customers, Products, Customers_Products
        WHERE 
        Customers.c_id = Customers_Products.c_id and Products.p_id = Customers_Products.p_id
      """
mycursor.execute(sql)
rows = mycursor.fetchall()
rows

[(1, 'Ali', 1, 'laptop1', 1, 1),
 (1, 'Ali', 4, 'laptop4', 1, 4),
 (3, 'Diana', 4, 'laptop4', 3, 4),
 (5, 'Zahra', 3, 'laptop3', 5, 3)]

In [42]:
sql = "SELECT * from Customers"
mycursor.execute(sql)
index = mycursor.fetchall()
for i in index:
    #print(i[0])
    num = i[0]
    sql = f"""
        SELECT product_name FROM Customers, Products, Customers_Products
        WHERE 
        Customers.c_id = Customers_Products.c_id and 
        Products.p_id = Customers_Products.p_id and
        Customers.c_id = {num}
      """
    mycursor.execute(sql)
    rows = mycursor.fetchall()
    print(i[1],rows)

Ali [('laptop1',), ('laptop4',)]
Sara []
Diana [('laptop4',)]
Maryam []
Zahra [('laptop3',)]